DataProcessors/MRS_СоздатьНоменклатуруПоEXCEL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>MRS_СоздатьНоменклатуруПоEXCEL</Name>
			<Comment>shvetsov</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/MRS_СоответствиеСтаройНовойНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>MRS_СоответствиеСтаройНовойНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтараяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоваяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВскрытаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СборкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СборкаТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатусУказанияСерий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>MRS_ДополнительныеАкцизныеМарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/MRS_СоздатьНоменклатуруПоEXCEL/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СоздатьсборкиНаСервере()
	
	// Определение режима работы: обработка одной номенклатуры или массовая обработка всего регистра
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		// Режим 1: Обработка одной номенклатуры
		ОбработатьОднуНоменклатуру();
		
	Иначе
		
		// Режим 2: Массовая обработка всего регистра
		ОбработатьВсеЗаписиРегистра();
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка одной номенклатуры (Режим 1)
Процедура ОбработатьОднуНоменклатуру()
	
	// Шаг 1: Поиск записи в регистре MRS_СоответствиеСтаройНовойНоменклатуры
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	МассивСоответствий.СтараяНоменклатура КАК СтараяНоменклатура,
	|	МассивСоответствий.НоваяНоменклатура КАК НоваяНоменклатура,
	|	МассивСоответствий.ВскрытаяНоменклатура КАК ВскрытаяНоменклатура
	|ИЗ
	|	РегистрСведений.MRS_СоответствиеСтаройНовойНоменклатуры КАК МассивСоответствий
	|ГДЕ
	|	(МассивСоответствий.СтараяНоменклатура = &Номенклатура
	|		ИЛИ МассивСоответствий.ВскрытаяНоменклатура = &Номенклатура)
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		// Определение сценария
		Если ЗначениеЗаполнено(Выборка.СтараяНоменклатура) Тогда
			
			// Сценарий 1А: Замена с остатками
			ОбработатьЗаменуСОстатками(Выборка.СтараяНоменклатура, Выборка.НоваяНоменклатура);
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.ВскрытаяНоменклатура) Тогда
			
			// Сценарий 1Б: Только обновление соответствий
			ОбновитьСоответствияСФронтСистемами(Выборка.ВскрытаяНоменклатура, Выборка.НоваяНоменклатура);
			
		Иначе
			
			// Некорректные данные в регистре
			
		КонецЕсли;
		
	Иначе
		
		Сообщить("Для выбранной номенклатуры """ + Строка(Номенклатура) + """ не найдена запись в регистре MRS_СоответствиеСтаройНовойНоменклатуры!");
		
	КонецЕсли;
	
КонецПроцедуры

// Массовая обработка всего регистра (Режим 2)
Процедура ОбработатьВсеЗаписиРегистра()
	
	// Выборка всех записей из регистра MRS_СоответствиеСтаройНовойНоменклатуры
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	МассивСоответствий.СтараяНоменклатура КАК СтараяНоменклатура,
	|	МассивСоответствий.НоваяНоменклатура КАК НоваяНоменклатура,
	|	МассивСоответствий.ВскрытаяНоменклатура КАК ВскрытаяНоменклатура
	|ИЗ
	|	РегистрСведений.MRS_СоответствиеСтаройНовойНоменклатуры КАК МассивСоответствий
	|ГДЕ
	|	МассивСоответствий.НоваяНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.СтараяНоменклатура) Тогда
			
			// Сценарий: Замена с остатками
			ОбработатьЗаменуСОстатками(Выборка.СтараяНоменклатура, Выборка.НоваяНоменклатура);
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.ВскрытаяНоменклатура) и НЕ ТолькоБезСоответствий Тогда
			
			// Сценарий: Только обновление соответствий
			ОбновитьСоответствияСФронтСистемами(Выборка.ВскрытаяНоменклатура, Выборка.НоваяНоменклатура);
			
		Иначе
			
			// Некорректные данные в регистре - пропускаем
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработка замены номенклатуры с остатками (Сценарий 1А)
//
// Параметры:
//  СтараяНоменклатура - СправочникСсылка.Номенклатура - Номенклатура, подлежащая замене
//  НоваяНоменклатура - СправочникСсылка.Номенклатура - Целевая номенклатура для замены
//
Процедура ОбработатьЗаменуСОстатками(СтараяНоменклатура, НоваяНоменклатура)
	
	// Получение упаковки новой номенклатуры
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Владелец = &НоваяНоменклатура
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НоваяНоменклатура", НоваяНоменклатура);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВыборкаУпаковки = Результат.Выбрать();
	ВыборкаУпаковки.Следующий();
	УпаковкаНоменклатуры = ВыборкаУпаковки.Упаковка;
	
	//////////////////////////////////////////////////////////////////////
	
	// Шаг 2: Запрос остатков по складам с группировкой
	ТекстЗапросаОстатков = "ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	ТоварыНаСкладахОстатки.Серия.Номер КАК СерияНомер,
	|	ТоварыНаСкладахОстатки.Склад.ПЛ_Организация КАК Организация,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Штрихкод
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|			И Номенклатура.ВидНоменклатуры <> &ИсключитьДиапазон
	|			И Склад <> &ИсключаемыеСклады
	|			#УсловиеСклад#
	|			) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ШтрихкодыУпаковокТоваров.Номенклатура)
	|			И (ТоварыНаСкладахОстатки.Серия.Номер = ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода)
	|ИТОГИ
	|	СУММА(ВНаличииОстаток)
	|ПО
	|	Склад";

	// Учет параметра Склад
	Если ЗначениеЗаполнено(Склад) Тогда
		
		ТекстЗапросаОстатков = СтрЗаменить(ТекстЗапросаОстатков, "#УсловиеСклад#", " И Склад = &Склад");
		
	Иначе
		
		ТекстЗапросаОстатков = СтрЗаменить(ТекстЗапросаОстатков, "#УсловиеСклад#", "");
		
	КонецЕсли;
	
	ЗапросОстатков = Новый Запрос(ТекстЗапросаОстатков);
	ЗапросОстатков.УстановитьПараметр("ИсключитьДиапазон", Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("AE40B1EF-7234-11ED-825B-000C29589659")));// Готовая алкогольная продукция с ФСМ (Справочники.ВидыНоменклатуры)
	ЗапросОстатков.УстановитьПараметр("ИсключаемыеСклады", Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("5C6C3FFC-B7A6-11EB-818F-98F2B3347817")));// 505 Склад алкогольной продукции Винодельни_М.ПРО (МРИЯ.ПРО ООО) (Справочники.Склады)
	ЗапросОстатков.УстановитьПараметр("Дата", Новый Граница(?(ЗначениеЗаполнено(Период), КонецДня(Период), КонецДня(ТекущаяДатаСеанса())), ВидГраницы.Включая));
	ЗапросОстатков.УстановитьПараметр("Номенклатура", СтараяНоменклатура);
	
	Если ЗначениеЗаполнено(Склад) Тогда
		
		ЗапросОстатков.УстановитьПараметр("Склад", Склад);
		
	КонецЕсли;
	
	ВыборкаСклад = ЗапросОстатков.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Шаг 3: Создание отдельного документа сборки для каждого склада
	Пока ВыборкаСклад.Следующий() Цикл
		
		Если ВыборкаСклад.ВНаличииОстаток > 0 Тогда
			
			ДокументСборки = Документы.СборкаТоваров.СоздатьДокумент();
			ДокументСборки.Комментарий = "#Документ создан обработкой комплектации в литражную номенклатуру.";
			ДокументСборки.Организация = ?(ЗначениеЗаполнено(ВыборкаСклад.Организация), ВыборкаСклад.Организация, Справочники.Организации.ПустаяСсылка());
			ДокументСборки.Склад = ВыборкаСклад.Склад;
			ДокументСборки.Дата = ТекущаяДатаСеанса();
			ДокументСборки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
			ДокументСборки.Номенклатура = НоваяНоменклатура;
			ДокументСборки.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ДокументСборки.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
			ДокументСборки.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			ДокументСборки.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
			ДокументСборки.КоличествоУпаковок = ВыборкаСклад.ВНаличииОстаток;
			ДокументСборки.Упаковка = УпаковкаНоменклатуры;
			ДокументСборки.Количество = ВыборкаСклад.ВНаличииОстаток;
			ДокументСборки.СтатусУказанияСерий = 4;
			
			СтрокаТЧТовары = ДокументСборки.Товары.Добавить();
			СтрокаТЧТовары.Номенклатура = СтараяНоменклатура;
			СтрокаТЧТовары.Количество = ВыборкаСклад.ВНаличииОстаток;
			СтрокаТЧТовары.КоличествоУпаковок = ВыборкаСклад.ВНаличииОстаток;
			СтрокаТЧТовары.СтатусУказанияСерий = 4;
			
			ВыборкаСерия = ВыборкаСклад.Выбрать();
			
			Пока ВыборкаСерия.Следующий() Цикл
				
				СтрокаСерии = ДокументСборки.Серии.Добавить();
				СтрокаСерии.Номенклатура = ВыборкаСерия.Номенклатура;
				СтрокаСерии.Серия = ВыборкаСерия.Серия;
				СтрокаСерии.Количество = 1;
				
				СтрокаСерии = ДокументСборки.Серии.Добавить();
				СтрокаСерии.Номенклатура = НоваяНоменклатура;
				СтрокаСерии.Количество = НоваяНоменклатура.ОбъемДАЛ * 10;
				СтрокаСерии.Серия = ВыборкаСерия.Серия;
				
				// Замена номенклатуры в штрихкодах
				Если ЗначениеЗаполнено(ВыборкаСерия.Штрихкод) Тогда
					
					ШтрихкодОбъект = ВыборкаСерия.Штрихкод.ПолучитьОбъект();
					ШтрихкодОбъект.Номенклатура = НоваяНоменклатура;
					ШтрихкодОбъект.Упаковка = УпаковкаНоменклатуры;
					ШтрихкодОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДокументСборки.Записать(РежимЗаписиДокумента.Запись);
			СтрокаДокументы = ТаблицаСборок.Добавить();
			СтрокаДокументы.ДокументыСборки = ДокументСборки.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ТолькоБезСоответствий Тогда
		// Шаг 4: Обновление регистра ПЛ_СоответствиеСФронтСистемами
		ОбновитьСоответствияСФронтСистемами(СтараяНоменклатура.ПЛ_НоменклатураВоВскрытойТаре.Ссылка, НоваяНоменклатура);
	КонецЕсли;
КонецПроцедуры

// Обновление соответствий с фронт-системами
//
// Параметры:
//  ОбъектДляПоиска - СправочникСсылка.Номенклатура - Объект для поиска в регистре ПЛ_СоответствиеСФронтСистемами
//  НоваяНоменклатура - СправочникСсылка.Номенклатура - Целевая номенклатура для установки в НоменклатураАлкоголь
//
Процедура ОбновитьСоответствияСФронтСистемами(ОбъектДляПоиска, НоваяНоменклатура)
	
	Если НЕ ЗначениеЗаполнено(ОбъектДляПоиска) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ПЛ_СоответствиеСФронтСистемами.Код КАК Код
	|ИЗ
	|	РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК ПЛ_СоответствиеСФронтСистемами
	|ГДЕ
	|	ПЛ_СоответствиеСФронтСистемами.Объект = &Объект
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", ОбъектДляПоиска);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.ПЛ_СоответствиеСФронтСистемами.СоздатьНаборЗаписей();
		Набор.Отбор.Код.Установить(Выборка.Код);
		Набор.Прочитать();
		
		Для Каждого Запись Из Набор Цикл
			
			Запись.НоменклатураАлкоголь = НоваяНоменклатура;
			
		КонецЦикла;
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Создатьсборки(Команда)
	СоздатьсборкиНаСервере();
КонецПроцедуры

// ============================================================================
// Процедуры для многопоточной обработки
// ============================================================================

// Формирует и выполняет запрос для выборки данных из регистра соответствий
//
// Параметры:
//  ПараметрыОтбора - Структура - параметры для отбора данных:
//   * Склад - СправочникСсылка.Склады - склад для обработки (необязательный)
//   * Номенклатура - СправочникСсылка.Номенклатура - конкретная номенклатура (необязательный)
//
// Возвращаемое значение:
//  РезультатЗапроса - результат запроса для обхода в многопоточном режиме
//
&НаСервере
Функция ПолучитьДанныеДляОбработки(ПараметрыОтбора = Неопределено)
	
	// Определение режима работы: одна номенклатура или массовая обработка
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("Номенклатура") 
		И ЗначениеЗаполнено(ПараметрыОтбора.Номенклатура) Тогда
		
		// Режим 1: Обработка одной номенклатуры
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	МассивСоответствий.СтараяНоменклатура КАК СтараяНоменклатура,
		|	МассивСоответствий.НоваяНоменклатура КАК НоваяНоменклатура,
		|	МассивСоответствий.ВскрытаяНоменклатура КАК ВскрытаяНоменклатура
		|ИЗ
		|	РегистрСведений.MRS_СоответствиеСтаройНовойНоменклатуры КАК МассивСоответствий
		|ГДЕ
		|	(МассивСоответствий.СтараяНоменклатура = &Номенклатура
		|		ИЛИ МассивСоответствий.ВскрытаяНоменклатура = &Номенклатура)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Номенклатура", ПараметрыОтбора.Номенклатура);
		
	Иначе
		
		// Режим 2: Массовая обработка всего регистра
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	МассивСоответствий.СтараяНоменклатура КАК СтараяНоменклатура,
		|	МассивСоответствий.НоваяНоменклатура КАК НоваяНоменклатура,
		|	МассивСоответствий.ВскрытаяНоменклатура КАК ВскрытаяНоменклатура
		|ИЗ
		|	РегистрСведений.MRS_СоответствиеСтаройНовойНоменклатуры КАК МассивСоответствий
		|ГДЕ
		|	МассивСоответствий.НоваяНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И (МассивСоответствий.СтараяНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ИЛИ МассивСоответствий.ВскрытаяНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Обрабатывает одну запись из регистра соответствий
//
// Параметры:
//  ПараметрыОбработки - Структура - параметры для обработки записи:
//   * СтараяНоменклатура - СправочникСсылка.Номенклатура - номенклатура для замены
//   * НоваяНоменклатура - СправочникСсылка.Номенклатура - целевая номенклатура
//   * ВскрытаяНоменклатура - СправочникСсылка.Номенклатура - вскрытая номенклатура
//   * Склад - СправочникСсылка.Склады - склад для обработки
//   * Период - Дата - период для расчета остатков
//   * ТолькоБезСоответствий - Булево - обрабатывать только записи без соответствий
//
// Возвращаемое значение:
//  Структура - результат обработки:
//   * Успех - Булево - признак успешной обработки
//   * СозданныеДокументы - Массив из ДокументСсылка.СборкаТоваров - созданные документы
//   * ТекстОшибки - Строка - текст ошибки (если есть)
//
&НаСервере
Функция ОбработатьЗаписьДанных(ПараметрыОбработки)
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Истина);
	Результат.Вставить("СозданныеДокументы", Новый Массив);
	Результат.Вставить("ТекстОшибки", "");
	
	СтараяНоменклатура = ПараметрыОбработки.СтараяНоменклатура;
	НоваяНоменклатура = ПараметрыОбработки.НоваяНоменклатура;
	ВскрытаяНоменклатура = ПараметрыОбработки.ВскрытаяНоменклатура;
	СкладОбработки = ПараметрыОбработки.Склад;
	ПериодОбработки = ПараметрыОбработки.Период;
	ТолькоБезСоответствийОбработки = ПараметрыОбработки.ТолькоБезСоответствий;
	
	Попытка
		
		Если ЗначениеЗаполнено(СтараяНоменклатура) Тогда
			
			// Сценарий: Замена с остатками
			МассивДокументов = ОбработатьЗаменуСОстаткамиМногопоток(СтараяНоменклатура, НоваяНоменклатура, 
				СкладОбработки, ПериодОбработки, ТолькоБезСоответствийОбработки);
			
			Для Каждого Документ Из МассивДокументов Цикл
				Результат.СозданныеДокументы.Добавить(Документ);
			КонецЦикла;
			
		ИначеЕсли ЗначениеЗаполнено(ВскрытаяНоменклатура) И НЕ ТолькоБезСоответствийОбработки Тогда
			
			// Сценарий: Только обновление соответствий
			ОбновитьСоответствияСФронтСистемами(ВскрытаяНоменклатура, НоваяНоменклатура);
			
		КонецЕсли;
		
	Исключение
		
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Обработка замены номенклатуры с остатками для многопоточного режима
// (копия ОбработатьЗаменуСОстатками с возвратом массива документов)
//
// Параметры:
//  СтараяНоменклатура - СправочникСсылка.Номенклатура - Номенклатура, подлежащая замене
//  НоваяНоменклатура - СправочникСсылка.Номенклатура - Целевая номенклатура для замены
//  СкладОбработки - СправочникСсылка.Склады - Склад для обработки
//  ПериодОбработки - Дата - Период для расчета остатков
//  ТолькоБезСоответствийОбработки - Булево - Обрабатывать только без соответствий
//
// Возвращаемое значение:
//  Массив из ДокументСсылка.СборкаТоваров - созданные документы сборки
//
Функция ОбработатьЗаменуСОстаткамиМногопоток(СтараяНоменклатура, НоваяНоменклатура, СкладОбработки, ПериодОбработки, ТолькоБезСоответствийОбработки)
	
	МассивДокументов = Новый Массив;
	
	// Получение упаковки новой номенклатуры
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Владелец = &НоваяНоменклатура
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НоваяНоменклатура", НоваяНоменклатура);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат МассивДокументов;
		
	КонецЕсли;
	
	ВыборкаУпаковки = Результат.Выбрать();
	ВыборкаУпаковки.Следующий();
	УпаковкаНоменклатуры = ВыборкаУпаковки.Упаковка;
	
	// Запрос остатков по складам с группировкой
	ТекстЗапросаОстатков = "ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	ТоварыНаСкладахОстатки.Серия.Номер КАК СерияНомер,
	|	ТоварыНаСкладахОстатки.Склад.ПЛ_Организация КАК Организация,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Штрихкод
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|			И Номенклатура.ВидНоменклатуры <> &ИсключитьДиапазон
	|			И Склад <> &ИсключаемыеСклады
	|			#УсловиеСклад#
	|			) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ШтрихкодыУпаковокТоваров.Номенклатура)
	|			И (ТоварыНаСкладахОстатки.Серия.Номер = ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода)
	|ИТОГИ
	|	СУММА(ВНаличииОстаток)
	|ПО
	|	Склад";
	
	// Учет параметра Склад
	Если ЗначениеЗаполнено(СкладОбработки) Тогда
		
		ТекстЗапросаОстатков = СтрЗаменить(ТекстЗапросаОстатков, "#УсловиеСклад#", " И Склад = &Склад");
		
	Иначе
		
		ТекстЗапросаОстатков = СтрЗаменить(ТекстЗапросаОстатков, "#УсловиеСклад#", "");
		
	КонецЕсли;
	
	ЗапросОстатков = Новый Запрос(ТекстЗапросаОстатков);
	ЗапросОстатков.УстановитьПараметр("ИсключитьДиапазон", Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("AE40B1EF-7234-11ED-825B-000C29589659")));
	ЗапросОстатков.УстановитьПараметр("ИсключаемыеСклады", Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("5C6C3FFC-B7A6-11EB-818F-98F2B3347817")));
	ЗапросОстатков.УстановитьПараметр("Дата", Новый Граница(?(ЗначениеЗаполнено(ПериодОбработки), КонецДня(ПериодОбработки), КонецДня(ТекущаяДатаСеанса())), ВидГраницы.Включая));
	ЗапросОстатков.УстановитьПараметр("Номенклатура", СтараяНоменклатура);
	
	Если ЗначениеЗаполнено(СкладОбработки) Тогда
		
		ЗапросОстатков.УстановитьПараметр("Склад", СкладОбработки);
		
	КонецЕсли;
	
	ВыборкаСклад = ЗапросОстатков.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Создание отдельного документа сборки для каждого склада
	Пока ВыборкаСклад.Следующий() Цикл
		
		Если ВыборкаСклад.ВНаличииОстаток > 0 Тогда
			
			ДокументСборки = Документы.СборкаТоваров.СоздатьДокумент();
			ДокументСборки.Комментарий = "#Документ создан обработкой комплектации в литражную номенклатуру.";
			ДокументСборки.Организация = ?(ЗначениеЗаполнено(ВыборкаСклад.Организация), ВыборкаСклад.Организация, Справочники.Организации.ПустаяСсылка());
			ДокументСборки.Склад = ВыборкаСклад.Склад;
			ДокументСборки.Дата = ТекущаяДатаСеанса();
			ДокументСборки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
			ДокументСборки.Номенклатура = НоваяНоменклатура;
			ДокументСборки.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ДокументСборки.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
			ДокументСборки.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			ДокументСборки.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
			ДокументСборки.КоличествоУпаковок = ВыборкаСклад.ВНаличииОстаток;
			ДокументСборки.Упаковка = УпаковкаНоменклатуры;
			ДокументСборки.Количество = ВыборкаСклад.ВНаличииОстаток;
			ДокументСборки.СтатусУказанияСерий = 4;
			
			СтрокаТЧТовары = ДокументСборки.Товары.Добавить();
			СтрокаТЧТовары.Номенклатура = СтараяНоменклатура;
			СтрокаТЧТовары.Количество = ВыборкаСклад.ВНаличииОстаток;
			СтрокаТЧТовары.КоличествоУпаковок = ВыборкаСклад.ВНаличииОстаток;
			СтрокаТЧТовары.СтатусУказанияСерий = 4;
			
			ВыборкаСерия = ВыборкаСклад.Выбрать();
			
			Пока ВыборкаСерия.Следующий() Цикл
				
				СтрокаСерии = ДокументСборки.Серии.Добавить();
				СтрокаСерии.Номенклатура = ВыборкаСерия.Номенклатура;
				СтрокаСерии.Серия = ВыборкаСерия.Серия;
				СтрокаСерии.Количество = 1;
				
				СтрокаСерии = ДокументСборки.Серии.Добавить();
				СтрокаСерии.Номенклатура = НоваяНоменклатура;
				СтрокаСерии.Количество = НоваяНоменклатура.ОбъемДАЛ * 10;
				СтрокаСерии.Серия = ВыборкаСерия.Серия;
				
				// Замена номенклатуры в штрихкодах
				Если ЗначениеЗаполнено(ВыборкаСерия.Штрихкод) Тогда
					
					ШтрихкодОбъект = ВыборкаСерия.Штрихкод.ПолучитьОбъект();
					ШтрихкодОбъект.Номенклатура = НоваяНоменклатура;
					ШтрихкодОбъект.Упаковка = УпаковкаНоменклатуры;
					ШтрихкодОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДокументСборки.Записать(РежимЗаписиДокумента.Запись);
			МассивДокументов.Добавить(ДокументСборки.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ТолькоБезСоответствийОбработки Тогда
		
		ОбновитьСоответствияСФронтСистемами(СтараяНоменклатура.ПЛ_НоменклатураВоВскрытойТаре.Ссылка, НоваяНоменклатура);
		
	КонецЕсли;
	
	Возврат МассивДокументов;
	
КонецФункции
